package main

import "fmt"

// N2 定义一个新的类型 ，底层类型为 int
type N2 int

// 为 N2 类型定义一个方法 test
func (n N2) test() {
	// 打印当前接收器 n 的值
	fmt.Println(n)
}

// 在 Go 语言中，n.test 创建了一个方法值，并捕获了 n 的当前值。当你执行这个方法值时
// 实际上是执行了当时绑定到 n 值上的方法。因此，方法值记录了那个时刻 n 的状态
func main() {
	// 声明一个 N2 类型的变量 n，初始值为 10
	var n N2 = 10
	// 创建一个指向 n 的指针 p
	p := &n

	// 将 n 的值自增 1，此时 n 的值为 11
	n++
	// 创建一个方法值 f1，此时捕获的接收器值为 n 的当前值（11）
	f1 := n.test

	// 将 n 的值再次自增 1，此时 n 的值为 12
	n++
	// 创建一个方法值 f2，此时捕获的接收器值为 p 指向的 n 的当前值（12）
	f2 := p.test

	// 将 n 的值再自增 1，此时 n 的值为 13
	n++
	// 打印 n 的当前值（13）
	fmt.Println(n)

	// 调用方法值 f1，输出捕获时的接收器值（11）
	f1()
	// 调用方法值 f2，输出捕获时的接收器值（12）
	f2()
}
